app/controllers/twitter_publish_controller.rb

SELECT `fortune_quotes`.* FROM `fortune_quotes` WHERE (`fortune_quotes`.`id` = 92) LIMIT 1
---
 def tweet
   Twitter.configure do |config|
     config.consumer_key=TWIT_CONFIG['development']['consumer_key']
     config.consumer_secret =TWIT_CONFIG['development']['consumer_secret']
     config.oauth_token =TWIT_CONFIG['development']['oauth_token']
     config.oauth_token_secret =TWIT_CONFIG['development']['oauth_token_secret']
   end
   @a=FortuneQuote.find(params[:id])

SELECT `fortune_quotes`.* FROM `fortune_quotes` WHERE (`fortune_quotes`.`id` = 34) LIMIT 1
---
  def facebookpost
    access_token=FB_CONFIG['development']['access_token']
    page_id=FB_CONFIG['development']['pag_id']
    page = FbGraph::Page.new(page_id, :access_token =>access_token)
    @a=FortuneQuote.find(params[:id])

SELECT COUNT(*) AS count_id FROM `fortune_quotes`
SELECT `fortune_quotes`.* FROM `fortune_quotes` WHERE (quote like '%get%' and id > 0) LIMIT 1
---
  def fortune
    @count = FortuneQuote.count.to_i

SELECT `fortune_quotes`.* FROM `fortune_quotes` WHERE (`fortune_quotes`.`id` = 92) LIMIT 1
---
	    @filter=""
	    @no=1+rand(@count-1)
	end
	@a=FortuneQuote.find(@no)